Курс_Бухгалтерские_задачи/src/Documents/СписаниеОсновныхСредств/СписаниеОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеОсновныхСредств</name>
  <registerRecords>InformationRegister.СвойстваОсновныхСредств</registerRecords>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Курс_Бухгалтерские_задачи/src/InformationRegisters/СвойстваОсновныхСредств/СвойстваОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваОсновныхСредств</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОсновногоСредства</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериальноОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Курс_Бухгалтерские_задачи/src/Enums/СостоянияОсновногоСредства/СостоянияОсновногоСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОсновногоСредства</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
</mdclass:Enum>

Курс_Бухгалтерские_задачи/src/Documents/СписаниеОсновныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СписокОС = ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	//ПВХОС = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Основные Средства");

	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	//ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1"));
	//ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2"));
	//ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3"));
	//ЭлементБД.УстановитьЗначение("Организация", Организация);
	//ЭлементБД.УстановитьЗначение("Подразделение", Подразделение);
	//ЭлементБД.ИсточникДанных = ОсновныеСредства;
	//ЭлементБД.ИспользоватьИзИсточникаДанных(ПВХОС, "ОсновноеСредство");
	//ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;
	//Блокировка.Заблокировать();	
	
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.Записать();
	
	Движения.СвойстваОсновныхСредств.Записывать = Истина;
	Движения.СвойстваОсновныхСредств.Записать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СчетПС", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1"));
	Запрос.УстановитьПараметр("СчетАМ", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2"));
	Запрос.УстановитьПараметр("списокОС", СписокОС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиПС.Субконто1 КАК ОсновноеСредство,
	|	ОстаткиПС.СуммаОстаток КАК ОстатокПС,
	|	ОстаткиАМ.СуммаОстаток КАК ОстатокАМ
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(
	|			&Период,
	|			Счет = &СчетПС,
	|			,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И Субконто1 В (&списокОС)) КАК ОстаткиПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Проводки.Остатки(
	|				&Период,
	|				Счет = &СчетАМ,
	|				,
	|				Организация = &Организация
	|					И Подразделение = &Подразделение
	|					И Субконто1 В (&списокОС)) КАК ОстаткиАМ
	|		ПО ОстаткиПС.Субконто1 = ОстаткиАМ.Субконто1";
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3");
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1");
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 1, Выборка.ОсновноеСредство);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеКт = Подразделение;
		Движение.ПодразделениеДт = Подразделение;
		Движение.Сумма = Выборка.ОстатокПС;
		Движение.Содержание = "Списание ОС";
		
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2");
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 1, Выборка.ОсновноеСредство);		
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3");		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеКт = Подразделение;
		Движение.ПодразделениеДт = Подразделение;
		Движение.Сумма = -Выборка.ОстатокАМ;
		Движение.Содержание = "Списание ОС";
		
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3");		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеКт = Подразделение;
		Движение.Сумма = Выборка.ОстатокПС+Выборка.ОстатокАМ;
		Движение.Содержание = "Списание ОС";
		
		Движение = Движения.СвойстваОсновныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ОсновноеСредство = Выборка.ОсновноеСредство;
		Движение.Состояние = Перечисления.СостоянияОсновногоСредства.НеИспользуется;
	
	КонецЦикла;
	
КонецПроцедуры
